blogs/mu4e.org
#+TITLE: Mailmacs: Email within Emacs With ~mu4e~, ~msmtp~, ~gnome-keyring~, and ~mbsync~.
#+AUTHOR: Ryan
#+EMAIL: ryan@ryanmj.xyz
#+OPTIONS: num:nil

In this post you will learn how to set up and configure ~mbsync~, ~msmtp~, mu with ~mu4e~ on Linux (debian-based and Arch-based).

There are many guides on the internet on how to set up ~mu4e~, but here, I aim at the best, most complex configuration possible.
There are lots of moving parts that need to be perfectly in-sync in order to get this done properly. It is a PITA if you are a beginner.
This post is essentially an amalgamation of the best aspects of other guides I found, which I will link to throughout the post and at the
bottom of the article.

The final configuration will have ~mbsync~ as the mailbox synchronizer, ~mu~ as the indexer, ~mu4e~ as the mail client, ~msmtp~ as the smtp client, 
and ~gnome-keyring~ as a password manager.

** Getting everything you need:
Obviously you will need to have Emacs installed and set up as a system daemon using ~emacsclient~. 
Read [[https://www.emacswiki.org/emacs/EmacsAsDaemon][this article]] to learn how to set this up if you haven't already.
*** On Arch Linux:
#+BEGIN_SRC sh
  sudo pacman -Syu msmtp msmtp-mta isync gnome-keyring libsecret seahorse
#+END_SRC

You will also need the package ~mu~ from the AUR.

*** On Debian
#+BEGIN_SRC sh
  sudo apt-get update && sudo apt-get upgrade
  sudo apt-get install mu4e isync msmtp msmtp-gnome gnome-keyring libsecret-tools seahorse libsecret-1-dev maildirutils
#+END_SRC

** Prepping Your Email
*** Gmail
If you're a technically minded person in <current year> you shoulnd't be using Gmail if you have a choice (or G©©gle in general). 
Get a cheap xyz domain, a VPS, and set up a mail server. That being said, many people don't have a choice, or are like me and have 
their old gmail attached to too many accounts across the internet.

In order to download your Email so it can be used by Emacs you must first [[https://support.google.com/mail/answer/7126229][enable IMAP support]].
If you have two factor authentication (which you should), you will also need to [[https://support.google.com/accounts/answer/185833?hl=en][create an app password]]. Copy your password to the clipboard.
*** Personal Email Server
If you're like me and you just set up your own personal email server with the help of [[https://www.youtube.com/watch?v=9zP7qooM4pY&t=179s][Luke Smith's guide]] then you're set to go. However, 
this information from his github will be very  relevant to you:
#+BEGIN_QUOTE
Let's say you want to access your mail with Thunderbird or mutt or another email program. For my domain, the server information will be as follows:

    SMTP server: mail.lukesmith.xyz
    SMTP port: 587
    IMAP server: mail.lukesmith.xyz
    IMAP port: 993
    Username luke (I.e. not luke@lukesmith.xyz)

The last point is important. Many email systems use a full email address on login. Since we just simply use local PAM logins, only the user's name is used (this makes a difference if you're using my mutt-wizard, etc.).
#+END_QUOTE
