blogs/mu4e.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-07-01 Wed 17:06 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Mailmacs: Email within Emacs With <code>mu4e</code>, <code>msmtp</code>, <code>gnome-keyring</code>, and <code>mbsync</code>.</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Ryan" />
</head>
<body>
<div id="content">
<h1 class="title">Mailmacs: Email within Emacs With <code>mu4e</code>, <code>msmtp</code>, <code>gnome-keyring</code>, and <code>mbsync</code>.</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org52df86e">Getting everything you need:</a>
<ul>
<li><a href="#org9d8c21c">On Arch Linux:</a></li>
<li><a href="#org7080a47">On Debian</a></li>
</ul>
</li>
<li><a href="#orgb57d05f">Prepping Your Email</a>
<ul>
<li><a href="#org2bb70a1">Gmail</a></li>
<li><a href="#org759c87f">Personal Email Server</a></li>
</ul>
</li>
<li><a href="#org95e36a3"><code>mbsync</code></a></li>
<li><a href="#orge8bd333"><code>mu</code></a></li>
<li><a href="#org360adca"><code>msmtp</code></a></li>
<li><a href="#org74e24d5">Bringing it all together with <code>mu4e</code></a></li>
</ul>
</div>
</div>
<p>
In this post you will learn how to set up and configure <code>mbsync</code>, <code>msmtp</code>, mu with <code>mu4e</code> on Linux (debian-based and Arch-based).
</p>

<p>
There are many guides on the internet on how to set up <code>mu4e</code>, but here, I aim at the best, most complex configuration possible.
There are lots of moving parts that need to be perfectly in-sync in order to get this done properly. It is a PITA if you are a beginner.
This post is essentially an amalgamation of the best aspects of other guides I found, which I will link to throughout the post and at the
bottom of the article.
</p>

<p>
The final configuration will have <code>mbsync</code> as the mailbox synchronizer, <code>mu</code> as the indexer, <code>mu4e</code> as the mail client, <code>msmtp</code> as the smtp client, 
and <code>gnome-keyring</code> as a password manager.
</p>

<div id="outline-container-org52df86e" class="outline-2">
<h2 id="org52df86e">Getting everything you need:</h2>
<div class="outline-text-2" id="text-org52df86e">
<p>
Obviously you will need to have Emacs installed and set up as a system daemon using <code>emacsclient</code>. 
Read <a href="https://www.emacswiki.org/emacs/EmacsAsDaemon">this article</a> to learn how to set this up if you haven't already.
</p>
</div>
<div id="outline-container-org9d8c21c" class="outline-3">
<h3 id="org9d8c21c">On Arch Linux:</h3>
<div class="outline-text-3" id="text-org9d8c21c">
<div class="org-src-container">
<pre class="src src-sh">sudo pacman -Syu msmtp msmtp-mta isync gnome-keyring libsecret seahorse
</pre>
</div>

<p>
You will also need the package <code>mu</code> from the AUR.
</p>
</div>
</div>

<div id="outline-container-org7080a47" class="outline-3">
<h3 id="org7080a47">On Debian</h3>
<div class="outline-text-3" id="text-org7080a47">
<div class="org-src-container">
<pre class="src src-sh">sudo apt-get update &amp;&amp; sudo apt-get upgrade
sudo apt-get install mu4e isync msmtp msmtp-gnome gnome-keyring libsecret-tools seahorse libsecret-1-dev maildirutils
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb57d05f" class="outline-2">
<h2 id="orgb57d05f">Prepping Your Email</h2>
<div class="outline-text-2" id="text-orgb57d05f">
</div>
<div id="outline-container-org2bb70a1" class="outline-3">
<h3 id="org2bb70a1">Gmail</h3>
<div class="outline-text-3" id="text-org2bb70a1">
<p>
If you're a technically minded person in &lt;current year&gt; you shoulnd't be using Gmail if you have a choice (or G©©gle in general). 
Get a cheap xyz domain, a VPS, and set up a mail server. That being said, many people don't have a choice, or are like me and have 
their old gmail attached to too many accounts across the internet.
</p>

<p>
In order to download your Email so it can be used by Emacs you must first <a href="https://support.google.com/mail/answer/7126229">enable IMAP support</a>.
If you have two factor authentication (which you should), you will also need to <a href="https://support.google.com/accounts/answer/185833?hl=en">create an app password</a>. Copy your password to the clipboard.
</p>
</div>
</div>
<div id="outline-container-org759c87f" class="outline-3">
<h3 id="org759c87f">Personal Email Server</h3>
<div class="outline-text-3" id="text-org759c87f">
<p>
If you're like me and you just set up your own personal email server with the help of <a href="https://www.youtube.com/watch?v=9zP7qooM4pY&amp;t=179s">Luke Smith's guide</a> then you're set to go. However, 
this information from his github will be very  relevant to you:
</p>
<blockquote>
<p>
Let's say you want to access your mail with Thunderbird or mutt or another email program. For my domain, the server information will be as follows:
</p>

<p>
SMTP server: mail.lukesmith.xyz
SMTP port: 587
IMAP server: mail.lukesmith.xyz
IMAP port: 993
Username luke (I.e. not luke@lukesmith.xyz)
</p>

<p>
The last point is important. Many email systems use a full email address on login. Since we just simply use local PAM logins, only the user's name is used (this makes a difference if you're using my mutt-wizard, etc.).
</p>
</blockquote>
</div>
</div>
</div>
