blogs/mu4e.org
** ~mbsync~
- Note taken on [2020-06-30 Tue 18:09]
1. Create a directory ~~/.Maildir~ (or really, you can name it whatever you want).
2. Open a file called ~~/.mbsyncrc~ and paste this into it:
#+BEGIN_SRC conf
  ##############################################################################
  #                                 First Gmail                                #
  ##############################################################################
  
  # mbsyncrc based on
  # http://www.ict4g.net/adolfo/notes/2014/12/27/EmacsIMAP.html
  # ACCOUNT INFORMATION
  IMAPAccount gmail-1
  # Address to connect to
  Host imap.gmail.com
  User gmail1@gmail.com
  PassCmd "secret-tool lookup host imap.gmail.com user gmail1@gmail.com"
  AuthMechs LOGIN
  SSLType IMAPS
  SSLVersions TLSv1.2
  CertificateFile /etc/ssl/certs/ca-certificates.crt

  # THEN WE SPECIFY THE LOCAL AND REMOTE STORAGE
  # - THE REMOTE STORAGE IS WHERE WE GET THE MAIL FROM (E.G., THE
  #   SPECIFICATION OF AN IMAP ACCOUNT)
  # - THE LOCAL STORAGE IS WHERE WE STORE THE EMAIL ON OUR COMPUTER

  # REMOTE STORAGE (USE THE IMAP ACCOUNT SPECIFIED ABOVE)
  IMAPStore gmail-1-remote
  Account gmail-1

  # LOCAL STORAGE (CREATE DIRECTORIES with mkdir -p ~/.Maildir/gmail-1)
  MaildirStore gmail-1-local
  Path ~/.Maildir/gmail-1/
  Inbox ~/.Maildir/gmail-1/INBOX
  # REQUIRED ONLY IF YOU WANT TO DOWNLOAD ALL SUBFOLDERS; SYNCING SLOWS DOWN
  # SubFolders Verbatim

  # CONNECTIONS SPECIFY LINKS BETWEEN REMOTE AND LOCAL FOLDERS
  #
  # CONNECTIONS ARE SPECIFIED USING PATTERNS, WHICH MATCH REMOTE MAIl
  # FOLDERS. SOME COMMONLY USED PATTERS INCLUDE:
  #
  # 1 "*" TO MATCH EVERYTHING
  # 2 "!DIR" TO EXCLUDE "DIR"
  # 3 "DIR" TO MATCH DIR

  Channel gmail-1-inbox
  Master :gmail-1-remote:
  Slave :gmail-1-local:
  Patterns "INBOX"
  Create Both
  Expunge Both
  SyncState *

  Channel gmail-1-trash
  Master :gmail-1-remote:"[Gmail]/Trash"
  Slave :gmail-1-local:"[gmail1].Trash"
  Create Both
  Expunge Both
  SyncState *

  Channel gmail-1-sent
  Master :gmail-1-remote:"[Gmail]/Sent Mail"
  Slave :gmail-1-local:"[gmail1].Sent Mail"
  Create Both
  Expunge Both
  SyncState *

  Channel gmail-1-all
  Master :gmail-1-remote:"[Gmail]/All Mail"
  Slave :gmail-1-local:"[gmail1].All Mail"
  Create Both
  Expunge Both
  SyncState *

  Channel gmail-1-starred
  Master :gmail-1-remote:"[Gmail]/Starred"
  Slave :gmail-1-local:"[gmail1].Starred"
  Create Both
  Expunge Both
  SyncState *

  # GROUPS PUT TOGETHER CHANNELS, SO THAT WE CAN INVOKE
  # MBSYNC ON A GROUP TO SYNC ALL CHANNELS
  #
  # FOR INSTANCE: "mbsync gmail" GETS MAIL FROM
  # "gmail-inbox", "gmail-sent", and "gmail-trash"
  #
  Group gmail-1
  Channel gmail-1-inbox
  Channel gmail-1-sent
  Channel gmail-1-trash
  Channel gmail-1-all
  Channel gmail-1-starred


  ##############################################################################
  #                                 Second Gmail                               #
  ##############################################################################


  # ACCOUNT INFORMATION
  IMAPAccount gmail-2
  # Address to connect to
  Host imap.gmail.com
  User gmail2@gmail.com
  PassCmd "secret-tool lookup host imap.gmail.com user gmail2@gmail.com"
  AuthMechs LOGIN
  SSLType IMAPS
  SSLVersions TLSv1.2
  CertificateFile /etc/ssl/certs/ca-certificates.crt

  # THEN WE SPECIFY THE LOCAL AND REMOTE STORAGE
  # - THE REMOTE STORAGE IS WHERE WE GET THE MAIL FROM (E.G., THE
  #   SPECIFICATION OF AN IMAP ACCOUNT)
  # - THE LOCAL STORAGE IS WHERE WE STORE THE EMAIL ON OUR COMPUTER

  # REMOTE STORAGE (USE THE IMAP ACCOUNT SPECIFIED ABOVE)
  IMAPStore gmail-2-remote
  Account gmail-2

  # LOCAL STORAGE (CREATE DIRECTORIES with mkdir -p ~/Maildir/gmail-2)
  MaildirStore gmail-2-local
  Path ~/.Maildir/gmail-2/
  Inbox ~/.Maildir/gmail-2/INBOX

  # CONNECTIONS SPECIFY LINKS BETWEEN REMOTE AND LOCAL FOLDERS
  #
  # CONNECTIONS ARE SPECIFIED USING PATTERNS, WHICH MATCH REMOTE MAIl
  # FOLDERS. SOME COMMONLY USED PATTERS INCLUDE:
  #
  # 1 "*" TO MATCH EVERYTHING
  # 2 "!DIR" TO EXCLUDE "DIR"
  # 3 "DIR" TO MATCH DIR

  Channel gmail-2-inbox
  Master :gmail-2-remote:
  Slave :gmail-2-local:
  Patterns "INBOX"
  Create Both
  Expunge Both
  SyncState *

  Channel gmail-2-trash
  Master :gmail-2-remote:"[Gmail]/Trash"
  Slave :gmail-2-local:"[gmail2].Trash"
  Create Both
  Expunge Both
  SyncState *

  Channel gmail-2-sent
  Master :gmail-2-remote:"[Gmail]/Sent Mail"
  Slave :gmail-2-local:"[gmail2].Sent Mail"
  Create Both
  Expunge Both
  SyncState *

  Channel gmail-2-all
  Master :gmail-2-remote:"[Gmail]/All Mail"
  Slave :gmail-2-local:"[gmail2].All Mail"
  Create Both
  Expunge Both
  SyncState *

  Channel gmail-2-starred
  Master :gmail-2-remote:"[Gmail]/Starred"
  Slave :gmail-2-local:"[gmail2].Starred"
  Create Both
  Expunge Both
  SyncState *

  # GROUPS PUT TOGETHER CHANNELS, SO THAT WE CAN INVOKE
  # MBSYNC ON A GROUP TO SYNC ALL CHANNELS
  #
  # FOR INSTANCE: "mbsync gmail" GETS MAIL FROM
  # "gmail-inbox", "gmail-sent", and "gmail-trash"
  #
  Group gmail-2
  Channel gmail-2-inbox
  Channel gmail-2-sent
  Channel gmail-2-trash
  Channel gmail-2-all
  Channel gmail-2-starred

  ################################################################################
  #                             personal webserver                               #
  ################################################################################

  # mbsyncrc based on
  # http://www.ict4g.net/adolfo/notes/2014/12/27/EmacsIMAP.html
  # ACCOUNT INFORMATION
  IMAPAccount personal-mail
  # Address to connect to
  Host mail.personal-site.xyz
  User me
  PassCmd "secret-tool lookup host mail.personal.xyz user ryan"
  AuthMechs LOGIN
  SSLType IMAPS
  SSLVersions TLSv1.2
  CertificateFile /etc/ssl/certs/ca-certificates.crt

  # THEN WE SPECIFY THE LOCAL AND REMOTE STORAGE
  # - THE REMOTE STORAGE IS WHERE WE GET THE MAIL FROM (E.G., THE
  #   SPECIFICATION OF AN IMAP ACCOUNT)
  # - THE LOCAL STORAGE IS WHERE WE STORE THE EMAIL ON OUR COMPUTER

  # REMOTE STORAGE (USE THE IMAP ACCOUNT SPECIFIED ABOVE)
  IMAPStore personal-mail
  Account personal-mail

  # LOCAL STORAGE (CREATE DIRECTORIES with mkdir -p ~/Maildir/gmail-1)
  MaildirStore personal-mail-local
  Path ~/.Maildir/personal-mail/
  Inbox ~/.Maildir/personal-mail/INBOX
  # REQUIRED ONLY IF YOU WANT TO DOWNLOAD ALL SUBFOLDERS; SYNCING SLOWS DOWN
  # SubFolders Verbatim

  # CONNECTIONS SPECIFY LINKS BETWEEN REMOTE AND LOCAL FOLDERS
  #
  # CONNECTIONS ARE SPECIFIED USING PATTERNS, WHICH MATCH REMOTE MAIl
  # FOLDERS. SOME COMMONLY USED PATTERS INCLUDE:
  #
  # 1 "*" TO MATCH EVERYTHING
  # 2 "!DIR" TO EXCLUDE "DIR"
  # 3 "DIR" TO MATCH DIR

  Channel personal-mail-inbox
  Master :personal-mail:
  Slave :personal-mail-local:
  Patterns "INBOX"
  Create Both
  Expunge Both
  SyncState *

  Channel personal-mail-trash
  Master :personal-mail:"Trash"
  Slave :personal-mail-local:"[personal].Trash"
  Create Both
  Expunge Both
  SyncState *

  Channel personal-mail-sent
  Master :personal-mail:"Sent"
  Slave :personal-mail-local:"[personal].Sent Mail"
  Create Both
  Expunge Both
  SyncState *

  Channel personal-mail-junk
  Master :personal-mail:"Junk"
  Slave :personal-mail-local:"[personal].Junk"
  Create Both
  Expunge Both
  SyncState *

  Channel personal-mail-drafts
  Master :personal-mail:"Drafts"
  Slave :personal-mail-local:"[personal].Drafts"
  Create Both
  Expunge Both
  SyncState *


  # GROUPS PUT TOGETHER CHANNELS, SO THAT WE CAN INVOKE
  # MBSYNC ON A GROUP TO SYNC ALL CHANNELS
  #
  # FOR INSTANCE: "mbsync gmail" GETS MAIL FROM
  # "gmail-inbox", "gmail-sent", and "gmail-trash"
  #
  Group personal-mail
  Channel personal-mail-inbox
  Channel personal-mail-sent
  Channel personal-mail-trash
  Channel personal-mail-junk
  Channel personal-mail-drafts    
#+END_SRC
Replace ~gmail-1~, ~gmail-2~, and ~personal-mail~ with arbitrary names of your choosing 
(make sure to also change the names in the slave/mail local sections as well.) If you named
your Maildir anything other than ~~/.Maildir~ then make sure you change the paths as well!

Note for Mac users: the crt file paths might not be accurate.

3. Set up the passwords.
We will be using gnome-keyring and libsecret for our passwords. For Gmail, run the command below (while inserting your username), 
and paste the app password you got from google as a response.
#+BEGIN_SRC shell
secret-tool store --label=isync host imap.gmail.com service mbsync user yourusername@gmail.com
#+END_SRC
You can verify that it worked with the following:
#+BEGIN_SRC shell
secret-tool lookup host imap.gmail.com user yourusername@gmail.com
#+END_SRC
Or, you could use the graphical password manager ~seahorse~ to verify the password.

For your personal mail server the same information applies, except you should replace ~imap.gmail.com~ with ~mail.yoururl.urdomain~,
and replace the gmail address with *JUST* your username, no ~@yoururl.urdomain~. For example, my email is ryan@ryanmj.xyz, so my 
username is just ~ryan~.

Lastly, we need to create the subdirectories in the Maildir. The mbsyncrc file will be your guide. 
You need to create one subdirectory for each email you have. Mine would have ~gmail-1/~ ~gmail-2/~ and ~personal-mail/~.
Replace those names with the names associated with the ~IMAPAccount~ label in your mbsyncrc. 
Next, we must create the `slave' folders. If ~gmail-1~ has an ~All Mail~ slave channel, then create ~gmail-1/[gmail1].All Mail/~.

Example Maildir:
#+BEGIN_SRC
  In ~/.Maildir/
  gmail-1/INBOX
  gmail-1/[gmail1].All Mail
  gmail-1/[gmail1].bin
  gmail-1/[gmail1].Bin
  gmail-1/[gmail1].drafts
  gmail-1/[gmail1].Sent Mail
  gmail-1/[gmail1].Starred
  gmail-1/[gmail1].Trash
  gmail-1/queue

  gmail-2/INBOX
  gmail-2/queue
  gmail-2/[gmail2].All Mail
  gmail-2/[gmail2].bin
  gmail-2/[gmail2].Bin
  gmail-2/[gmail2].drafts
  gmail-2/[gmail2].Sent Mail
  gmail-2/[gmail2].Starred
  gmail-2/[gmail2].Trash

  personal-mail/INBOX
  personal-mail/[personal].Drafts
  personal-mail/[personal].Junk
  personal-mail/[personal].Sent Mail
  personal-mail/[personal].Trash
#+END_SRC


Once that business is finished, you can finally run mbsync! Just:
#+BEGIN_SRC sh
  mbsync -a
#+END_SRC

If it begins to work at first but then suddenly fails: don't freak out! If you're downloading a lot of mail you might have just 
reached a bandwidth limit. Just try again later!
