blogs/mu4e.html
<div id="outline-container-org95e36a3" class="outline-2">
<h2 id="org95e36a3"><code>mbsync</code></h2>
<div class="outline-text-2" id="text-org95e36a3">
<ul class="org-ul">
<li>Note taken on <span class="timestamp-wrapper"><span class="timestamp">[2020-06-30 Tue 18:09]</span></span></li>
<li>Create a directory <code>~/.Maildir</code> (or really, you can name it whatever you want).</li>
<li>Open a file called <code>~/.mbsyncrc</code> and paste this into it:</li>
</ul>
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #a8a8a8;">##############################################################################</span>
<span style="color: #a8a8a8;">#                                 </span><span style="color: #a8a8a8;">First Gmail                                #</span>
<span style="color: #a8a8a8;">##############################################################################</span>

<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">mbsyncrc based on</span>
<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">http://www.ict4g.net/adolfo/notes/2014/12/27/EmacsIMAP.html</span>
<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">ACCOUNT INFORMATION</span>
IMAPAccount gmail-1
<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">Address to connect to</span>
Host imap.gmail.com
User gmail1@gmail.com
PassCmd <span style="color: #72a4ff;">"secret-tool lookup host imap.gmail.com user gmail1@gmail.com"</span>
AuthMechs LOGIN
SSLType IMAPS
SSLVersions TLSv1.2
CertificateFile /etc/ssl/certs/ca-certificates.crt

<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">THEN WE SPECIFY THE LOCAL AND REMOTE STORAGE</span>
<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">- THE REMOTE STORAGE IS WHERE WE GET THE MAIL FROM (E.G., THE</span>
<span style="color: #a8a8a8;">#   </span><span style="color: #a8a8a8;">SPECIFICATION OF AN IMAP ACCOUNT)</span>
<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">- THE LOCAL STORAGE IS WHERE WE STORE THE EMAIL ON OUR COMPUTER</span>

<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">REMOTE STORAGE (USE THE IMAP ACCOUNT SPECIFIED ABOVE)</span>
IMAPStore gmail-1-remote
Account gmail-1

<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">LOCAL STORAGE (CREATE DIRECTORIES with mkdir -p ~/.Maildir/gmail-1)</span>
MaildirStore gmail-1-local
Path ~/.Maildir/gmail-1/
Inbox ~/.Maildir/gmail-1/INBOX
<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">REQUIRED ONLY IF YOU WANT TO DOWNLOAD ALL SUBFOLDERS; SYNCING SLOWS DOWN</span>
<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">SubFolders Verbatim</span>

<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">CONNECTIONS SPECIFY LINKS BETWEEN REMOTE AND LOCAL FOLDERS</span>
<span style="color: #a8a8a8;">#</span>
<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">CONNECTIONS ARE SPECIFIED USING PATTERNS, WHICH MATCH REMOTE MAIl</span>
<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">FOLDERS. SOME COMMONLY USED PATTERS INCLUDE:</span>
<span style="color: #a8a8a8;">#</span>
<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">1 "*" TO MATCH EVERYTHING</span>
<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">2 "!DIR" TO EXCLUDE "DIR"</span>
<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">3 "DIR" TO MATCH DIR</span>

Channel gmail-1-inbox
Master :gmail-1-remote:
Slave :gmail-1-local:
Patterns <span style="color: #72a4ff;">"INBOX"</span>
Create Both
Expunge Both
SyncState *

Channel gmail-1-trash
Master :gmail-1-remote:<span style="color: #72a4ff;">"[Gmail]/Trash"</span>
Slave :gmail-1-local:<span style="color: #72a4ff;">"[gmail1].Trash"</span>
Create Both
Expunge Both
SyncState *

Channel gmail-1-sent
Master :gmail-1-remote:<span style="color: #72a4ff;">"[Gmail]/Sent Mail"</span>
Slave :gmail-1-local:<span style="color: #72a4ff;">"[gmail1].Sent Mail"</span>
Create Both
Expunge Both
SyncState *

Channel gmail-1-all
Master :gmail-1-remote:<span style="color: #72a4ff;">"[Gmail]/All Mail"</span>
Slave :gmail-1-local:<span style="color: #72a4ff;">"[gmail1].All Mail"</span>
Create Both
Expunge Both
SyncState *

Channel gmail-1-starred
Master :gmail-1-remote:<span style="color: #72a4ff;">"[Gmail]/Starred"</span>
Slave :gmail-1-local:<span style="color: #72a4ff;">"[gmail1].Starred"</span>
Create Both
Expunge Both
SyncState *

<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">GROUPS PUT TOGETHER CHANNELS, SO THAT WE CAN INVOKE</span>
<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">MBSYNC ON A GROUP TO SYNC ALL CHANNELS</span>
<span style="color: #a8a8a8;">#</span>
<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">FOR INSTANCE: "mbsync gmail" GETS MAIL FROM</span>
<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">"gmail-inbox", "gmail-sent", and "gmail-trash"</span>
<span style="color: #a8a8a8;">#</span>
Group gmail-1
Channel gmail-1-inbox
Channel gmail-1-sent
Channel gmail-1-trash
Channel gmail-1-all
Channel gmail-1-starred


<span style="color: #a8a8a8;">##############################################################################</span>
<span style="color: #a8a8a8;">#                                 </span><span style="color: #a8a8a8;">Second Gmail                               #</span>
<span style="color: #a8a8a8;">##############################################################################</span>


<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">ACCOUNT INFORMATION</span>
IMAPAccount gmail-2
<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">Address to connect to</span>
Host imap.gmail.com
User gmail2@gmail.com
PassCmd <span style="color: #72a4ff;">"secret-tool lookup host imap.gmail.com user gmail2@gmail.com"</span>
AuthMechs LOGIN
SSLType IMAPS
SSLVersions TLSv1.2
CertificateFile /etc/ssl/certs/ca-certificates.crt

<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">THEN WE SPECIFY THE LOCAL AND REMOTE STORAGE</span>
<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">- THE REMOTE STORAGE IS WHERE WE GET THE MAIL FROM (E.G., THE</span>
<span style="color: #a8a8a8;">#   </span><span style="color: #a8a8a8;">SPECIFICATION OF AN IMAP ACCOUNT)</span>
<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">- THE LOCAL STORAGE IS WHERE WE STORE THE EMAIL ON OUR COMPUTER</span>

<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">REMOTE STORAGE (USE THE IMAP ACCOUNT SPECIFIED ABOVE)</span>
IMAPStore gmail-2-remote
Account gmail-2

<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">LOCAL STORAGE (CREATE DIRECTORIES with mkdir -p ~/Maildir/gmail-2)</span>
MaildirStore gmail-2-local
Path ~/.Maildir/gmail-2/
Inbox ~/.Maildir/gmail-2/INBOX

<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">CONNECTIONS SPECIFY LINKS BETWEEN REMOTE AND LOCAL FOLDERS</span>
<span style="color: #a8a8a8;">#</span>
<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">CONNECTIONS ARE SPECIFIED USING PATTERNS, WHICH MATCH REMOTE MAIl</span>
<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">FOLDERS. SOME COMMONLY USED PATTERS INCLUDE:</span>
<span style="color: #a8a8a8;">#</span>
<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">1 "*" TO MATCH EVERYTHING</span>
<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">2 "!DIR" TO EXCLUDE "DIR"</span>
<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">3 "DIR" TO MATCH DIR</span>

Channel gmail-2-inbox
Master :gmail-2-remote:
Slave :gmail-2-local:
Patterns <span style="color: #72a4ff;">"INBOX"</span>
Create Both
Expunge Both
SyncState *

Channel gmail-2-trash
Master :gmail-2-remote:<span style="color: #72a4ff;">"[Gmail]/Trash"</span>
Slave :gmail-2-local:<span style="color: #72a4ff;">"[gmail2].Trash"</span>
Create Both
Expunge Both
SyncState *

Channel gmail-2-sent
Master :gmail-2-remote:<span style="color: #72a4ff;">"[Gmail]/Sent Mail"</span>
Slave :gmail-2-local:<span style="color: #72a4ff;">"[gmail2].Sent Mail"</span>
Create Both
Expunge Both
SyncState *

Channel gmail-2-all
Master :gmail-2-remote:<span style="color: #72a4ff;">"[Gmail]/All Mail"</span>
Slave :gmail-2-local:<span style="color: #72a4ff;">"[gmail2].All Mail"</span>
Create Both
Expunge Both
SyncState *

Channel gmail-2-starred
Master :gmail-2-remote:<span style="color: #72a4ff;">"[Gmail]/Starred"</span>
Slave :gmail-2-local:<span style="color: #72a4ff;">"[gmail2].Starred"</span>
Create Both
Expunge Both
SyncState *

<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">GROUPS PUT TOGETHER CHANNELS, SO THAT WE CAN INVOKE</span>
<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">MBSYNC ON A GROUP TO SYNC ALL CHANNELS</span>
<span style="color: #a8a8a8;">#</span>
<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">FOR INSTANCE: "mbsync gmail" GETS MAIL FROM</span>
<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">"gmail-inbox", "gmail-sent", and "gmail-trash"</span>
<span style="color: #a8a8a8;">#</span>
Group gmail-2
Channel gmail-2-inbox
Channel gmail-2-sent
Channel gmail-2-trash
Channel gmail-2-all
Channel gmail-2-starred

<span style="color: #a8a8a8;">################################################################################</span>
<span style="color: #a8a8a8;">#                             </span><span style="color: #a8a8a8;">personal webserver                               #</span>
<span style="color: #a8a8a8;">################################################################################</span>

<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">mbsyncrc based on</span>
<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">http://www.ict4g.net/adolfo/notes/2014/12/27/EmacsIMAP.html</span>
<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">ACCOUNT INFORMATION</span>
IMAPAccount personal-mail
<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">Address to connect to</span>
Host mail.personal-site.xyz
User me
PassCmd <span style="color: #72a4ff;">"secret-tool lookup host mail.personal.xyz user ryan"</span>
AuthMechs LOGIN
SSLType IMAPS
SSLVersions TLSv1.2
CertificateFile /etc/ssl/certs/ca-certificates.crt

<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">THEN WE SPECIFY THE LOCAL AND REMOTE STORAGE</span>
<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">- THE REMOTE STORAGE IS WHERE WE GET THE MAIL FROM (E.G., THE</span>
<span style="color: #a8a8a8;">#   </span><span style="color: #a8a8a8;">SPECIFICATION OF AN IMAP ACCOUNT)</span>
<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">- THE LOCAL STORAGE IS WHERE WE STORE THE EMAIL ON OUR COMPUTER</span>

<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">REMOTE STORAGE (USE THE IMAP ACCOUNT SPECIFIED ABOVE)</span>
IMAPStore personal-mail
Account personal-mail

<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">LOCAL STORAGE (CREATE DIRECTORIES with mkdir -p ~/Maildir/gmail-1)</span>
MaildirStore personal-mail-local
Path ~/.Maildir/personal-mail/
Inbox ~/.Maildir/personal-mail/INBOX
<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">REQUIRED ONLY IF YOU WANT TO DOWNLOAD ALL SUBFOLDERS; SYNCING SLOWS DOWN</span>
<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">SubFolders Verbatim</span>

<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">CONNECTIONS SPECIFY LINKS BETWEEN REMOTE AND LOCAL FOLDERS</span>
<span style="color: #a8a8a8;">#</span>
<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">CONNECTIONS ARE SPECIFIED USING PATTERNS, WHICH MATCH REMOTE MAIl</span>
<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">FOLDERS. SOME COMMONLY USED PATTERS INCLUDE:</span>
<span style="color: #a8a8a8;">#</span>
<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">1 "*" TO MATCH EVERYTHING</span>
<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">2 "!DIR" TO EXCLUDE "DIR"</span>
<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">3 "DIR" TO MATCH DIR</span>

Channel personal-mail-inbox
Master :personal-mail:
Slave :personal-mail-local:
Patterns <span style="color: #72a4ff;">"INBOX"</span>
Create Both
Expunge Both
SyncState *

Channel personal-mail-trash
Master :personal-mail:<span style="color: #72a4ff;">"Trash"</span>
Slave :personal-mail-local:<span style="color: #72a4ff;">"[personal].Trash"</span>
Create Both
Expunge Both
SyncState *

Channel personal-mail-sent
Master :personal-mail:<span style="color: #72a4ff;">"Sent"</span>
Slave :personal-mail-local:<span style="color: #72a4ff;">"[personal].Sent Mail"</span>
Create Both
Expunge Both
SyncState *

Channel personal-mail-junk
Master :personal-mail:<span style="color: #72a4ff;">"Junk"</span>
Slave :personal-mail-local:<span style="color: #72a4ff;">"[personal].Junk"</span>
Create Both
Expunge Both
SyncState *

Channel personal-mail-drafts
Master :personal-mail:<span style="color: #72a4ff;">"Drafts"</span>
Slave :personal-mail-local:<span style="color: #72a4ff;">"[personal].Drafts"</span>
Create Both
Expunge Both
SyncState *


<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">GROUPS PUT TOGETHER CHANNELS, SO THAT WE CAN INVOKE</span>
<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">MBSYNC ON A GROUP TO SYNC ALL CHANNELS</span>
<span style="color: #a8a8a8;">#</span>
<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">FOR INSTANCE: "mbsync gmail" GETS MAIL FROM</span>
<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">"gmail-inbox", "gmail-sent", and "gmail-trash"</span>
<span style="color: #a8a8a8;">#</span>
Group personal-mail
Channel personal-mail-inbox
Channel personal-mail-sent
Channel personal-mail-trash
Channel personal-mail-junk
Channel personal-mail-drafts    
</pre>
</div>
<p>
Replace <code>gmail-1</code>, <code>gmail-2</code>, and <code>personal-mail</code> with arbitrary names of your choosing 
(make sure to also change the names in the slave/mail local sections as well.) If you named
your Maildir anything other than <code>~/.Maildir</code> then make sure you change the paths as well!
</p>

<p>
Note for Mac users: the crt file paths might not be accurate.
</p>

<ol class="org-ol">
<li>Set up the passwords.</li>
</ol>
<p>
We will be using gnome-keyring and libsecret for our passwords. For Gmail, run the command below (while inserting your username), 
and paste the app password you got from google as a response.
</p>
<div class="org-src-container">
<pre class="src src-shell">secret-tool store --label=isync host imap.gmail.com service mbsync user yourusername@gmail.com
</pre>
</div>
<p>
You can verify that it worked with the following:
</p>
<div class="org-src-container">
<pre class="src src-shell">secret-tool lookup host imap.gmail.com user yourusername@gmail.com
</pre>
</div>
<p>
Or, you could use the graphical password manager <code>seahorse</code> to verify the password.
</p>

<p>
For your personal mail server the same information applies, except you should replace <code>imap.gmail.com</code> with <code>mail.yoururl.urdomain</code>,
and replace the gmail address with <b>JUST</b> your username, no <code>@yoururl.urdomain</code>. For example, my email is ryan@ryanmj.xyz, so my 
username is just <code>ryan</code>.
</p>

<p>
Lastly, we need to create the subdirectories in the Maildir. The mbsyncrc file will be your guide. 
You need to create one subdirectory for each email you have. Mine would have <code>gmail-1/</code> <code>gmail-2/</code> and <code>personal-mail/</code>.
Replace those names with the names associated with the <code>IMAPAccount</code> label in your mbsyncrc. 
Next, we must create the `slave' folders. If <code>gmail-1</code> has an <code>All Mail</code> slave channel, then create <code>gmail-1/[gmail1].All Mail/</code>.
</p>

<p>
Example Maildir:
</p>
<pre class="example">
In ~/.Maildir/
gmail-1/INBOX
gmail-1/[gmail1].All Mail
gmail-1/[gmail1].bin
gmail-1/[gmail1].Bin
gmail-1/[gmail1].drafts
gmail-1/[gmail1].Sent Mail
gmail-1/[gmail1].Starred
gmail-1/[gmail1].Trash
gmail-1/queue

gmail-2/INBOX
gmail-2/queue
gmail-2/[gmail2].All Mail
gmail-2/[gmail2].bin
gmail-2/[gmail2].Bin
gmail-2/[gmail2].drafts
gmail-2/[gmail2].Sent Mail
gmail-2/[gmail2].Starred
gmail-2/[gmail2].Trash

personal-mail/INBOX
personal-mail/[personal].Drafts
personal-mail/[personal].Junk
personal-mail/[personal].Sent Mail
personal-mail/[personal].Trash
</pre>


<p>
Once that business is finished, you can finally run mbsync! Just:
</p>
<div class="org-src-container">
<pre class="src src-sh">mbsync -a
</pre>
</div>

<p>
If it begins to work at first but then suddenly fails: don't freak out! If you're downloading a lot of mail you might have just 
reached a bandwidth limit. Just try again later!
</p>
</div>
</div>
