blogs/mu4e.org
** ~mu~
To set up mu:
#+BEGIN_SRC sh
mu init -m ~/.Maildir
#+END_SRC
Replace ~~/.Maildir~ with the location of your Maildir.
** ~msmtp~
#+BEGIN_SRC conf
account gmail1
host smtp.gmail.com
port 587
protocol smtp
auth on
from gmail1@gmail.com
user gmail1@gmail.com
# msmtp does not support OAuth, so instead you will have to use user/pass. If you don't have
# two factor auth enabled, enabling insecure apps to access your email should be sufficient and
# you can use your normal password, but if you do have it enabled you will need to generate an
# app password. See the comments in the offlineimap config for details.
# Once again I'm using `security` to pull the password from my macOS keychain.
#passwordeval security find-internet-password -g -a nan@nine27.com -s smtp.gmail.com -w
tls on
tls_starttls on
# If you don't have this cert, you can generate it by `brew install curl` and then running
# `/usr/local/Cellar/curl/<curl version>/libexec/mk-ca-bundle.pl`
tls_trust_file /etc/ssl/certs/ca-certificates.crt

account gmail2
host smtp.gmail.com
port 587
protocol smtp
auth on
from gmail2@gmail.com
user gmail2@gmail.com
# msmtp does not support OAuth, so instead you will have to use user/pass. If you don't have
# two factor auth enabled, enabling insecure apps to access your email should be sufficient and
# you can use your normal password, but if you do have it enabled you will need to generate an
# app password. See the comments in the offlineimap config for details.
# Once again I'm using `security` to pull the password from my macOS keychain.
#passwordeval security find-internet-password -g -a nan@nine27.com -s smtp.gmail.com -w
tls on
tls_starttls on
# If you don't have this cert, you can generate it by `brew install curl` and then running
# `/usr/local/Cellar/curl/<curl version>/libexec/mk-ca-bundle.pl`
tls_trust_file /etc/ssl/certs/ca-certificates.crt


# account do
# host smtp.gmail.com
# port 587
# protocol smtp
# auth on
# from nzhong@digitalocean.com
# user nzhong@digitalocean.com
# passwordeval security find-internet-password -g -a nzhong@digitalocean.com -s smtp.gmail.com -w
# tls on
# tls_trust_file ~/.msmtp/ca-bundle.crt

account personal
host mail.yoururl.urdomain
port 587
protocol smtp
auth plain
from personal@yoururl.urdomain
user personal

tls on
tls_starttls on
# If you don't have this cert, you can generate it by `brew install curl` and then running
# `/usr/local/Cellar/curl/<curl version>/libexec/mk-ca-bundle.pl`
tls_trust_file /etc/ssl/certs/ca-certificates.crt


#+END_SRC
Once again Mac users will have to watch those crt file paths.
