blogs/mu4e.html
<div id="outline-container-orge8bd333" class="outline-2">
<h2 id="orge8bd333"><code>mu</code></h2>
<div class="outline-text-2" id="text-orge8bd333">
<p>
To set up mu:
</p>
<div class="org-src-container">
<pre class="src src-sh">mu init -m ~/.Maildir
</pre>
</div>
<p>
Replace <code>~/.Maildir</code> with the location of your Maildir.
</p>
</div>
</div>
<div id="outline-container-org360adca" class="outline-2">
<h2 id="org360adca"><code>msmtp</code></h2>
<div class="outline-text-2" id="text-org360adca">
<div class="org-src-container">
<pre class="src src-conf">account gmail1
host smtp.gmail.com
port 587
protocol smtp
auth on
from gmail1@gmail.com
user gmail1@gmail.com
<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">msmtp does not support OAuth, so instead you will have to use user/pass. If you don't have</span>
<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">two factor auth enabled, enabling insecure apps to access your email should be sufficient and</span>
<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">you can use your normal password, but if you do have it enabled you will need to generate an</span>
<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">app password. See the comments in the offlineimap config for details.</span>
<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">Once again I'm using `security` to pull the password from my macOS keychain.</span>
<span style="color: #a8a8a8;">#</span><span style="color: #a8a8a8;">passwordeval security find-internet-password -g -a nan@nine27.com -s smtp.gmail.com -w</span>
tls on
tls_starttls on
<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">If you don't have this cert, you can generate it by `brew install curl` and then running</span>
<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">`/usr/local/Cellar/curl/&lt;curl version&gt;/libexec/mk-ca-bundle.pl`</span>
tls_trust_file /etc/ssl/certs/ca-certificates.crt

account gmail2
host smtp.gmail.com
port 587
protocol smtp
auth on
from gmail2@gmail.com
user gmail2@gmail.com
<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">msmtp does not support OAuth, so instead you will have to use user/pass. If you don't have</span>
<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">two factor auth enabled, enabling insecure apps to access your email should be sufficient and</span>
<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">you can use your normal password, but if you do have it enabled you will need to generate an</span>
<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">app password. See the comments in the offlineimap config for details.</span>
<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">Once again I'm using `security` to pull the password from my macOS keychain.</span>
<span style="color: #a8a8a8;">#</span><span style="color: #a8a8a8;">passwordeval security find-internet-password -g -a nan@nine27.com -s smtp.gmail.com -w</span>
tls on
tls_starttls on
<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">If you don't have this cert, you can generate it by `brew install curl` and then running</span>
<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">`/usr/local/Cellar/curl/&lt;curl version&gt;/libexec/mk-ca-bundle.pl`</span>
tls_trust_file /etc/ssl/certs/ca-certificates.crt


<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">account do</span>
<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">host smtp.gmail.com</span>
<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">port 587</span>
<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">protocol smtp</span>
<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">auth on</span>
<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">from nzhong@digitalocean.com</span>
<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">user nzhong@digitalocean.com</span>
<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">passwordeval security find-internet-password -g -a nzhong@digitalocean.com -s smtp.gmail.com -w</span>
<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">tls on</span>
<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">tls_trust_file ~/.msmtp/ca-bundle.crt</span>

account personal
host mail.yoururl.urdomain
port 587
protocol smtp
auth plain
from personal@yoururl.urdomain
user personal

tls on
tls_starttls on
<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">If you don't have this cert, you can generate it by `brew install curl` and then running</span>
<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">`/usr/local/Cellar/curl/&lt;curl version&gt;/libexec/mk-ca-bundle.pl`</span>
tls_trust_file /etc/ssl/certs/ca-certificates.crt


</pre>
</div>
<p>
Once again Mac users will have to watch those crt file paths.
</p>
</div>
</div>
