blogs/mu4e.org
** Bringing it all together with ~mu4e~
Step 1. Find the location of mu4e. Your distro likely put it in ~/usr/share/emacs/site-lisp/mu4e/~ or ~/usr/local/share/emacs/site-lisp/mu4e/~

Step 2. In Emacs, install the packages:
#+BEGIN_SRC 
mu4e-alert mu4e-conversation mu4e-jump-to-list mu4e-maildirs-extension mu4e-overview mu4e-query-fragments
#+END_SRC

Step 3. Append this to your emacs config file:
#+BEGIN_SRC emacs-lisp
(require 'mu4e-alert)
;; Choose the style you prefer for desktop notifications
;; If you are on Linux you can use
;; 1. notifications - Emacs lisp implementation of the Desktop Notifications API
;; 2. libnotify     - Notifications using the `notify-send' program, requires `notify-send' to be in PATH
;;
;; On Mac OSX you can set style to
;; 1. notifier      - Notifications using the `terminal-notifier' program, requires `terminal-notifier' to be in PATH
;; 1. growl         - Notifications using the `growl' program, requires `growlnotify' to be in PATH
(mu4e-alert-set-default-style 'libnotify)
(add-hook 'after-init-hook #'mu4e-alert-enable-notifications)

(add-hook 'after-init-hook #'mu4e-alert-enable-mode-line-display) ; show unread email count on mode line

(mu4e-alert-enable-notifications)

;; mu4e-conversation: comines threads into a single buffer
(require 'mu4e-conversation)
(global-mu4e-conversation-mode)

;; allows users to jump to mailing lists
(require 'mu4e-jump-to-list)

;; Asynchronously update all emails in Maildir
(require 'mu4e-maildirs-extension)
(mu4e-maildirs-extension)

;; allows you to see an overview of your maildir
(require 'mu4e-overview)



(add-to-list 'load-path "/usr/share/emacs/site-lisp/mu4e/") ; change this to accommodate your path
(require 'mu4e)

(setq mu4e-maildir (expand-file-name "~/.Maildir"))

                                       ; get mail
(setq mu4e-get-mail-command "mbsync -a"
     ;; mu4e-html2text-command "w3m -T text/html" ;;using the default mu4e-shr2text
     mu4e-view-prefer-html t
     mu4e-update-interval 300
     mu4e-headers-auto-update t
     mu4e-compose-signature-auto-include nil
     mu4e-compose-format-flowed t)

;; to view selected message in the browser, no signin, just html mail
(add-to-list 'mu4e-view-actions
            '("ViewInBrowser" . mu4e-action-view-in-browser) t)

;; enable inline images
(setq mu4e-view-show-images t)
;; use imagemagick, if available
(when (fboundp 'imagemagick-register-types)
 (imagemagick-register-types))

;; every new email composition gets its own frame!
(setq mu4e-compose-in-new-frame t)

;; don't save message to Sent Messages, IMAP takes care of this
(setq mu4e-sent-messages-behavior 'delete)

(add-hook 'mu4e-view-mode-hook #'visual-line-mode)

;; (defun my-render-html-message ()
;; (let ((dom (libxml-parse-html-region (point-min) (point-max))))
;;   (erase-buffer)
;;   (shr-insert-document dom)
;;   (goto-char (point-min))))

;; (setq mu4e-html2text-command 'my-render-html-message)


;; <tab> to navigate to links, <RET> to open them in browser
(add-hook 'mu4e-view-mode-hook
         (lambda()
           ;; try to emulate some of the eww key-bindings
           (local-set-key (kbd "<RET>") 'mu4e~view-browse-url-from-binding)
           (local-set-key (kbd "<tab>") 'shr-next-link)
           (local-set-key (kbd "<backtab>") 'shr-previous-link)))

;; from https://www.reddit.com/r/emacs/comments/bfsck6/mu4e_for_dummies/elgoumx
(add-hook 'mu4e-headers-mode-hook
         (defun my/mu4e-change-headers ()
           (interactive)
           (setq mu4e-headers-fields
                 `((:human-date . 25) ;; alternatively, use :date
                   (:flags . 6)
                   (:from . 22)
                   (:thread-subject . ,(- (window-body-width) 70)) ;; alternatively, use :subject
                   (:size . 7)))))

;; if you use date instead of human-date in the above, use this setting
;; give me ISO(ish) format date-time stamps in the header list
;(setq mu4e-headers-date-format "%Y-%m-%d %H:%M")

;; spell check
(add-hook 'mu4e-compose-mode-hook
         (defun my-do-compose-stuff ()
           "My settings for message composition."
           (visual-line-mode)
                                        ;(org-mu4e-compose-org-mode)
           (use-hard-newlines -1)
           (flyspell-mode)))

;;rename files when moving
;;NEEDED FOR MBSYNC
(setq mu4e-change-filenames-when-moving t)

;;set up queue for offline email
;;use mu mkdir  ~/.Maildir/acc/queue to set up first

;;from the info manual
(setq mu4e-attachment-dir  "~/Downloads")

(setq message-kill-buffer-on-exit t)
(setq mu4e-compose-dont-reply-to-self t)

(require 'org-mu4e)

;; convert org mode to HTML automatically
(setq org-mu4e-convert-to-html t)
 
(setq mu4e-org-contacts-file  (expand-file-name "~/.emacs.d/contacts.org"))
(add-to-list 'mu4e-headers-actions
            '("org-contact-add" . mu4e-action-add-org-contact) t)
(add-to-list 'mu4e-view-actions
            '("org-contact-add" . mu4e-action-add-org-contact) t)

;;from vxlabs config
;; show full addresses in view message (instead of just names)
;; toggle per name with M-RET
(setq mu4e-view-show-addresses 't)

;; don't ask when quitting
(setq mu4e-confirm-quit nil)


(require 'feedmail)

;; mu4e-context
(setq mu4e-context-policy 'pick-first)
(setq mu4e-compose-context-policy 'always-ask)
(setq mu4e-contexts
     (list
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;; Old Gmail ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(make-mu4e-context
    :name "old-gmail" ;;for gmail-1
    :enter-func (lambda () (mu4e-message "Entering context old-gmail"))
    :leave-func (lambda () (mu4e-message "Leaving context old-gmail"))
    :match-func (lambda (msg)
                 (when msg
                   (mu4e-message-contact-field-matches
                    msg '(:from :to :cc :bcc) "gmail1@gmail.com")))
    :vars '((user-mail-address . "gmail1@gmail.com")
            (user-full-name . "Ryan")
               (mu4e-sent-folder . "/gmail-1/[gmail1].Sent Mail")
               (mu4e-drafts-folder . "/gmail-1/[gmail1].drafts")
               (mu4e-trash-folder . "/gmail-1/[gmail1].Bin")
               (mu4e-compose-signature . (concat "Formal Signature\n" "Emacs 25, org-mode 9, mu4e 1.0\n"))
               (mu4e-compose-format-flowed . t)
               (smtpmail-queue-dir . "~/.Maildir/gmail-1/queue/cur")

               (setq message-sendmail-envelope-from 'header)
               (Mu4e-maildir-shortcuts . ( ("/gmail-1/INBOX"            . ?i)
                                           ("/gmail-1/[gmail1].Sent Mail" . ?s)
                                           ("/gmail-1/[gmail1].Bin"       . ?t)
                                            ("/gmail-1/[gmail1].All Mail"  . ?a)
                                           ("/gmail-1/[gmail1].Starred"   . ?r)
                                           ("/gmail-1/[gmail1].drafts"    . ?d)
                                           ))))

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;; Private Mail ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

      (make-mu4e-context
       :name "personal" ;;for personal-mail
        :enter-func (lambda () (mu4e-message "Entering context personal"))
        :leave-func (lambda () (mu4e-message "Leaving context personal"))

        :match-func (lambda (msg)
           (when msg
         (mu4e-message-contact-field-matches
          msg '(:from :to :cc :bcc) "personal@yoururl.urdomain")))
        :vars '((user-mail-address . "personal@yoururl.urdomain")
                (user-full-name . "Ryan")      (mu4e-sent-folder . "/personal-mail/[personal].Sent Mail")
            (mu4e-drafts-folder . "/personal-mail/[personal].Drafts")
            (mu4e-trash-folder . "/personal-mail/[personal].Trash")
            (mu4e-compose-format-flowed . t)
            (smtpmail-queue-dir . "~/.Maildir/personal-mail/queue/cur")
            (mu4e-maildir-shortcuts . ( ("/personal-mail/INBOX"            . ?i)
                     ("/personal-mail/[personal].Sent Mail" . ?s)
                     ("/personal-mail/[personal].Trash"     . ?t)
                     ("/personal-mail/[personal].Junk"      . ?j)
                     ("/personal-mail/[personal].Drafts"    . ?d)
                     ))))
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;; New Gmail ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
      (make-mu4e-context
       :name "gmail" ;;for gmail-2
       :enter-func (lambda () (mu4e-message "Entering context gmail"))
       :leave-func (lambda () (mu4e-message "Leaving context gmail"))
       :match-func (lambda (msg)
                     (when msg
                   (mu4e-message-contact-field-matches
                    msg '(:from :to :cc :bcc) "gmail2@gmail.com")))
       :vars '((user-mail-address . "gmail2@gmail.com")
               (user-full-name . "Ryan")
               (mu4e-sent-folder . "/gmail-2/[gmail2].Sent Mail")
               (mu4e-drafts-folder . "/gmail-2/[gmail2].drafts")
               (mu4e-trash-folder . "/gmail-2/[gmail2].Bin")
               (mu4e-compose-signature . (concat "Formal Signature\n" "Emacs 25, org-mode 9, mu4e 1.0\n"))
               (mu4e-compose-format-flowed . t)
               (smtpmail-queue-dir . "~/.Maildir/gmail-2/queue/cur")
               (setq message-sendmail-envelope-from 'header)
               (mu4e-maildir-shortcuts . ( ("/gmail-2/INBOX"            . ?i)
                                       ("/gmail-2/[gmail2].Sent Mail" . ?s)
                                       ("/gmail-2/[gmail2].Bin"       . ?t)
                                       ("/gmail-2/[gmail2].All Mail"  . ?a)
                                       ("/gmail-2/[gmail2].Starred"   . ?r)
                                       ("/gmail-2/[gmail2].drafts"    . ?d)
                                                   ))))

              ))

;; Choose account label to feed msmtp -a option based on From header
;; in Message buffer; This function must be added to
;; message-send-mail-hook for on-the-fly change of From address before
;; sending message since message-send-mail-hook is processed right
;; before sending message.
(defun choose-msmtp-account ()
(if (message-mail-p)
(save-excursion
(let*
   ((from (save-restriction
        (message-narrow-to-headers)
        (message-fetch-field "from")))
    (account
 (cond
  ((string-match "gmail1@gmail.com" from) "gmail1")
  ((string-match "personal@yoururl.urdomain" from) "personal")
      ((string-match "gmail2@gmail.com" from) "gmail2"))))
     (setq message-sendmail-extra-arguments (list '"-a" account))))))

  
(setq message-sendmail-envelope-from 'header)
(setq message-send-mail-function 'message-send-mail-with-sendmail
      sendmail-program "/usr/bin/msmtp"
      user-full-name "Ryan")

(setq message-sendmail-envelope-from 'header)
(add-hook 'message-send-mail-hook 'choose-msmtp-account)

(setq mu4e-html2text-command 'mu4e-shr2text) 
#+END_SRC

Obviously, you should replace gmail1 with your gmail, etc. etc. you know the drill by now. 

Parts of this file also contain commented-out lines of configuration, and there are many ways you can customize your setup.
All of the extra packages like mu4e-alert are completely optional, you can remove any of them at will.

The bulk of this configuration file comes from [[https://www.reddit.com/r/emacs/comments/bfsck6/mu4e_for_dummies/][~mu4e~ for dummies]], while the very handy function choose-msmtp-account
comes from [[https://notanumber.io/2016-10-03/better-email-with-mu4e/][Better Email With ~mu4e~]].

And that's it! Enjoy your newfound productivity. You're now once step closer to being free from big tech.
