blogs/mu4e.html
<div id="outline-container-org74e24d5" class="outline-2">
<h2 id="org74e24d5">Bringing it all together with <code>mu4e</code></h2>
<div class="outline-text-2" id="text-org74e24d5">
<p>
Step 1. Find the location of mu4e. Your distro likely put it in <code>/usr/share/emacs/site-lisp/mu4e/</code> or <code>/usr/local/share/emacs/site-lisp/mu4e/</code>
</p>

<p>
Step 2. In Emacs, install the packages:
</p>
<pre class="example">
mu4e-alert mu4e-conversation mu4e-jump-to-list mu4e-maildirs-extension mu4e-overview mu4e-query-fragments
</pre>

<p>
Step 3. Append this to your emacs config file:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff;">require</span> '<span style="color: #00bdfa;">mu4e-alert</span><span style="color: #00cd68;">)</span>
<span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">Choose the style you prefer for desktop notifications</span>
<span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">If you are on Linux you can use</span>
<span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">1. notifications - Emacs lisp implementation of the Desktop Notifications API</span>
<span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">2. libnotify     - Notifications using the `</span><span style="color: #00bdfa;">notify-send</span><span style="color: #a8a8a8;">' program, requires `</span><span style="color: #00bdfa;">notify-send</span><span style="color: #a8a8a8;">' to be in PATH</span>
<span style="color: #a8a8a8;">;;</span>
<span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">On Mac OSX you can set style to</span>
<span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">1. notifier      - Notifications using the `</span><span style="color: #00bdfa;">terminal-notifier</span><span style="color: #a8a8a8;">' program, requires `</span><span style="color: #00bdfa;">terminal-notifier</span><span style="color: #a8a8a8;">' to be in PATH</span>
<span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">1. growl         - Notifications using the `</span><span style="color: #00bdfa;">growl</span><span style="color: #a8a8a8;">' program, requires `</span><span style="color: #00bdfa;">growlnotify</span><span style="color: #a8a8a8;">' to be in PATH</span>
<span style="color: #00cd68;">(</span>mu4e-alert-set-default-style 'libnotify<span style="color: #00cd68;">)</span>
<span style="color: #00cd68;">(</span>add-hook 'after-init-hook #'mu4e-alert-enable-notifications<span style="color: #00cd68;">)</span>

<span style="color: #00cd68;">(</span>add-hook 'after-init-hook #'mu4e-alert-enable-mode-line-display<span style="color: #00cd68;">)</span> <span style="color: #a8a8a8;">; </span><span style="color: #a8a8a8;">show unread email count on mode line</span>

<span style="color: #00cd68;">(</span>mu4e-alert-enable-notifications<span style="color: #00cd68;">)</span>

<span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">mu4e-conversation: comines threads into a single buffer</span>
<span style="color: #00cd68;">(</span><span style="color: #b6a0ff;">require</span> '<span style="color: #00bdfa;">mu4e-conversation</span><span style="color: #00cd68;">)</span>
<span style="color: #00cd68;">(</span>global-mu4e-conversation-mode<span style="color: #00cd68;">)</span>

<span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">allows users to jump to mailing lists</span>
<span style="color: #00cd68;">(</span><span style="color: #b6a0ff;">require</span> '<span style="color: #00bdfa;">mu4e-jump-to-list</span><span style="color: #00cd68;">)</span>

<span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">Asynchronously update all emails in Maildir</span>
<span style="color: #00cd68;">(</span><span style="color: #b6a0ff;">require</span> '<span style="color: #00bdfa;">mu4e-maildirs-extension</span><span style="color: #00cd68;">)</span>
<span style="color: #00cd68;">(</span>mu4e-maildirs-extension<span style="color: #00cd68;">)</span>

<span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">allows you to see an overview of your maildir</span>
<span style="color: #00cd68;">(</span><span style="color: #b6a0ff;">require</span> '<span style="color: #00bdfa;">mu4e-overview</span><span style="color: #00cd68;">)</span>



<span style="color: #00cd68;">(</span>add-to-list 'load-path <span style="color: #72a4ff;">"/usr/share/emacs/site-lisp/mu4e/"</span><span style="color: #00cd68;">)</span> <span style="color: #a8a8a8;">; </span><span style="color: #a8a8a8;">change this to accommodate your path</span>
<span style="color: #00cd68;">(</span><span style="color: #b6a0ff;">require</span> '<span style="color: #00bdfa;">mu4e</span><span style="color: #00cd68;">)</span>

<span style="color: #00cd68;">(</span><span style="color: #b6a0ff;">setq</span> mu4e-maildir <span style="color: #b6a0ff;">(</span>expand-file-name <span style="color: #72a4ff;">"~/.Maildir"</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>

                                       <span style="color: #a8a8a8;">; </span><span style="color: #a8a8a8;">get mail</span>
<span style="color: #00cd68;">(</span><span style="color: #b6a0ff;">setq</span> mu4e-get-mail-command <span style="color: #72a4ff;">"mbsync -a"</span>
     <span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">mu4e-html2text-command "w3m -T text/html" ;;using the default mu4e-shr2text</span>
     mu4e-view-prefer-html t
     mu4e-update-interval 300
     mu4e-headers-auto-update t
     mu4e-compose-signature-auto-include nil
     mu4e-compose-format-flowed t<span style="color: #00cd68;">)</span>

<span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">to view selected message in the browser, no signin, just html mail</span>
<span style="color: #00cd68;">(</span>add-to-list 'mu4e-view-actions
            '<span style="color: #b6a0ff;">(</span><span style="color: #72a4ff;">"ViewInBrowser"</span> . mu4e-action-view-in-browser<span style="color: #b6a0ff;">)</span> t<span style="color: #00cd68;">)</span>

<span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">enable inline images</span>
<span style="color: #00cd68;">(</span><span style="color: #b6a0ff;">setq</span> mu4e-view-show-images t<span style="color: #00cd68;">)</span>
<span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">use imagemagick, if available</span>
<span style="color: #00cd68;">(</span><span style="color: #b6a0ff;">when</span> <span style="color: #b6a0ff;">(</span>fboundp 'imagemagick-register-types<span style="color: #b6a0ff;">)</span>
 <span style="color: #b6a0ff;">(</span>imagemagick-register-types<span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>

<span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">every new email composition gets its own frame!</span>
<span style="color: #00cd68;">(</span><span style="color: #b6a0ff;">setq</span> mu4e-compose-in-new-frame t<span style="color: #00cd68;">)</span>

<span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">don't save message to Sent Messages, IMAP takes care of this</span>
<span style="color: #00cd68;">(</span><span style="color: #b6a0ff;">setq</span> mu4e-sent-messages-behavior 'delete<span style="color: #00cd68;">)</span>

<span style="color: #00cd68;">(</span>add-hook 'mu4e-view-mode-hook #'visual-line-mode<span style="color: #00cd68;">)</span>

<span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">(defun my-render-html-message ()</span>
<span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">(let ((dom (libxml-parse-html-region (point-min) (point-max))))</span>
<span style="color: #a8a8a8;">;;   </span><span style="color: #a8a8a8;">(erase-buffer)</span>
<span style="color: #a8a8a8;">;;   </span><span style="color: #a8a8a8;">(shr-insert-document dom)</span>
<span style="color: #a8a8a8;">;;   </span><span style="color: #a8a8a8;">(goto-char (point-min))))</span>

<span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">(setq mu4e-html2text-command 'my-render-html-message)</span>


<span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">&lt;tab&gt; to navigate to links, &lt;RET&gt; to open them in browser</span>
<span style="color: #00cd68;">(</span>add-hook 'mu4e-view-mode-hook
         <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff;">lambda</span><span style="color: #6ae4b9;">()</span>
           <span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">try to emulate some of the eww key-bindings</span>
           <span style="color: #6ae4b9;">(</span>local-set-key <span style="color: #f0ce43;">(</span>kbd <span style="color: #72a4ff;">"&lt;RET&gt;"</span><span style="color: #f0ce43;">)</span> 'mu4e~view-browse-url-from-binding<span style="color: #6ae4b9;">)</span>
           <span style="color: #6ae4b9;">(</span>local-set-key <span style="color: #f0ce43;">(</span>kbd <span style="color: #72a4ff;">"&lt;tab&gt;"</span><span style="color: #f0ce43;">)</span> 'shr-next-link<span style="color: #6ae4b9;">)</span>
           <span style="color: #6ae4b9;">(</span>local-set-key <span style="color: #f0ce43;">(</span>kbd <span style="color: #72a4ff;">"&lt;backtab&gt;"</span><span style="color: #f0ce43;">)</span> 'shr-previous-link<span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>

<span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">from https://www.reddit.com/r/emacs/comments/bfsck6/mu4e_for_dummies/elgoumx</span>
<span style="color: #00cd68;">(</span>add-hook 'mu4e-headers-mode-hook
         <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">my/mu4e-change-headers</span> <span style="color: #6ae4b9;">()</span>
           <span style="color: #6ae4b9;">(</span><span style="color: #b6a0ff;">interactive</span><span style="color: #6ae4b9;">)</span>
           <span style="color: #6ae4b9;">(</span><span style="color: #b6a0ff;">setq</span> mu4e-headers-fields
                 `<span style="color: #f0ce43;">(</span><span style="color: #00bdfa;">(</span><span style="color: #f78fe7;">:human-date</span> . 25<span style="color: #00bdfa;">)</span> <span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">alternatively, use :date</span>
                   <span style="color: #00bdfa;">(</span><span style="color: #f78fe7;">:flags</span> . 6<span style="color: #00bdfa;">)</span>
                   <span style="color: #00bdfa;">(</span><span style="color: #f78fe7;">:from</span> . 22<span style="color: #00bdfa;">)</span>
                   <span style="color: #00bdfa;">(</span><span style="color: #f78fe7;">:thread-subject</span> . ,<span style="color: #80d200;">(</span>- <span style="color: #f78fe7;">(</span>window-body-width<span style="color: #f78fe7;">)</span> 70<span style="color: #80d200;">)</span><span style="color: #00bdfa;">)</span> <span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">alternatively, use :subject</span>
                   <span style="color: #00bdfa;">(</span><span style="color: #f78fe7;">:size</span> . 7<span style="color: #00bdfa;">)</span><span style="color: #f0ce43;">)</span><span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>

<span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">if you use date instead of human-date in the above, use this setting</span>
<span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">give me ISO(ish) format date-time stamps in the header list</span>
<span style="color: #a8a8a8;">;</span><span style="color: #a8a8a8;">(setq mu4e-headers-date-format "%Y-%m-%d %H:%M")</span>

<span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">spell check</span>
<span style="color: #00cd68;">(</span>add-hook 'mu4e-compose-mode-hook
         <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">my-do-compose-stuff</span> <span style="color: #6ae4b9;">()</span>
           <span style="color: #c6eaff;">"My settings for message composition."</span>
           <span style="color: #6ae4b9;">(</span>visual-line-mode<span style="color: #6ae4b9;">)</span>
                                        <span style="color: #a8a8a8;">;</span><span style="color: #a8a8a8;">(org-mu4e-compose-org-mode)</span>
           <span style="color: #6ae4b9;">(</span>use-hard-newlines -1<span style="color: #6ae4b9;">)</span>
           <span style="color: #6ae4b9;">(</span>flyspell-mode<span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>

<span style="color: #a8a8a8;">;;</span><span style="color: #a8a8a8;">rename files when moving</span>
<span style="color: #a8a8a8;">;;</span><span style="color: #a8a8a8;">NEEDED FOR MBSYNC</span>
<span style="color: #00cd68;">(</span><span style="color: #b6a0ff;">setq</span> mu4e-change-filenames-when-moving t<span style="color: #00cd68;">)</span>

<span style="color: #a8a8a8;">;;</span><span style="color: #a8a8a8;">set up queue for offline email</span>
<span style="color: #a8a8a8;">;;</span><span style="color: #a8a8a8;">use mu mkdir  ~/.Maildir/acc/queue to set up first</span>

<span style="color: #a8a8a8;">;;</span><span style="color: #a8a8a8;">from the info manual</span>
<span style="color: #00cd68;">(</span><span style="color: #b6a0ff;">setq</span> mu4e-attachment-dir  <span style="color: #72a4ff;">"~/Downloads"</span><span style="color: #00cd68;">)</span>

<span style="color: #00cd68;">(</span><span style="color: #b6a0ff;">setq</span> message-kill-buffer-on-exit t<span style="color: #00cd68;">)</span>
<span style="color: #00cd68;">(</span><span style="color: #b6a0ff;">setq</span> mu4e-compose-dont-reply-to-self t<span style="color: #00cd68;">)</span>

<span style="color: #00cd68;">(</span><span style="color: #b6a0ff;">require</span> '<span style="color: #00bdfa;">org-mu4e</span><span style="color: #00cd68;">)</span>

<span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">convert org mode to HTML automatically</span>
<span style="color: #00cd68;">(</span><span style="color: #b6a0ff;">setq</span> org-mu4e-convert-to-html t<span style="color: #00cd68;">)</span>

<span style="color: #00cd68;">(</span><span style="color: #b6a0ff;">setq</span> mu4e-org-contacts-file  <span style="color: #b6a0ff;">(</span>expand-file-name <span style="color: #72a4ff;">"~/.emacs.d/contacts.org"</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
<span style="color: #00cd68;">(</span>add-to-list 'mu4e-headers-actions
            '<span style="color: #b6a0ff;">(</span><span style="color: #72a4ff;">"org-contact-add"</span> . mu4e-action-add-org-contact<span style="color: #b6a0ff;">)</span> t<span style="color: #00cd68;">)</span>
<span style="color: #00cd68;">(</span>add-to-list 'mu4e-view-actions
            '<span style="color: #b6a0ff;">(</span><span style="color: #72a4ff;">"org-contact-add"</span> . mu4e-action-add-org-contact<span style="color: #b6a0ff;">)</span> t<span style="color: #00cd68;">)</span>

<span style="color: #a8a8a8;">;;</span><span style="color: #a8a8a8;">from vxlabs config</span>
<span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">show full addresses in view message (instead of just names)</span>
<span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">toggle per name with M-RET</span>
<span style="color: #00cd68;">(</span><span style="color: #b6a0ff;">setq</span> mu4e-view-show-addresses 't<span style="color: #00cd68;">)</span>

<span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">don't ask when quitting</span>
<span style="color: #00cd68;">(</span><span style="color: #b6a0ff;">setq</span> mu4e-confirm-quit nil<span style="color: #00cd68;">)</span>


<span style="color: #00cd68;">(</span><span style="color: #b6a0ff;">require</span> '<span style="color: #00bdfa;">feedmail</span><span style="color: #00cd68;">)</span>

<span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">mu4e-context</span>
<span style="color: #00cd68;">(</span><span style="color: #b6a0ff;">setq</span> mu4e-context-policy 'pick-first<span style="color: #00cd68;">)</span>
<span style="color: #00cd68;">(</span><span style="color: #b6a0ff;">setq</span> mu4e-compose-context-policy 'always-ask<span style="color: #00cd68;">)</span>
<span style="color: #00cd68;">(</span><span style="color: #b6a0ff;">setq</span> mu4e-contexts
     <span style="color: #b6a0ff;">(</span>list
<span style="color: #a8a8a8;">;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;; </span><span style="color: #a8a8a8;">Old Gmail ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;</span>

<span style="color: #6ae4b9;">(</span>make-mu4e-context
    <span style="color: #f78fe7;">:name</span> <span style="color: #72a4ff;">"old-gmail"</span> <span style="color: #a8a8a8;">;;</span><span style="color: #a8a8a8;">for gmail-1</span>
    <span style="color: #f78fe7;">:enter-func</span> <span style="color: #f0ce43;">(</span><span style="color: #b6a0ff;">lambda</span> <span style="color: #00bdfa;">()</span> <span style="color: #00bdfa;">(</span>mu4e-message <span style="color: #72a4ff;">"Entering context old-gmail"</span><span style="color: #00bdfa;">)</span><span style="color: #f0ce43;">)</span>
    <span style="color: #f78fe7;">:leave-func</span> <span style="color: #f0ce43;">(</span><span style="color: #b6a0ff;">lambda</span> <span style="color: #00bdfa;">()</span> <span style="color: #00bdfa;">(</span>mu4e-message <span style="color: #72a4ff;">"Leaving context old-gmail"</span><span style="color: #00bdfa;">)</span><span style="color: #f0ce43;">)</span>
    <span style="color: #f78fe7;">:match-func</span> <span style="color: #f0ce43;">(</span><span style="color: #b6a0ff;">lambda</span> <span style="color: #00bdfa;">(</span>msg<span style="color: #00bdfa;">)</span>
                 <span style="color: #00bdfa;">(</span><span style="color: #b6a0ff;">when</span> msg
                   <span style="color: #80d200;">(</span>mu4e-message-contact-field-matches
                    msg '<span style="color: #f78fe7;">(</span><span style="color: #f78fe7;">:from</span> <span style="color: #f78fe7;">:to</span> <span style="color: #f78fe7;">:cc</span> <span style="color: #f78fe7;">:bcc</span><span style="color: #f78fe7;">)</span> <span style="color: #72a4ff;">"gmail1@gmail.com"</span><span style="color: #80d200;">)</span><span style="color: #00bdfa;">)</span><span style="color: #f0ce43;">)</span>
    <span style="color: #f78fe7;">:vars</span> '<span style="color: #f0ce43;">(</span><span style="color: #00bdfa;">(</span>user-mail-address . <span style="color: #72a4ff;">"gmail1@gmail.com"</span><span style="color: #00bdfa;">)</span>
            <span style="color: #00bdfa;">(</span>user-full-name . <span style="color: #72a4ff;">"Ryan"</span><span style="color: #00bdfa;">)</span>
               <span style="color: #00bdfa;">(</span>mu4e-sent-folder . <span style="color: #72a4ff;">"/gmail-1/[gmail1].Sent Mail"</span><span style="color: #00bdfa;">)</span>
               <span style="color: #00bdfa;">(</span>mu4e-drafts-folder . <span style="color: #72a4ff;">"/gmail-1/[gmail1].drafts"</span><span style="color: #00bdfa;">)</span>
               <span style="color: #00bdfa;">(</span>mu4e-trash-folder . <span style="color: #72a4ff;">"/gmail-1/[gmail1].Bin"</span><span style="color: #00bdfa;">)</span>
               <span style="color: #00bdfa;">(</span>mu4e-compose-signature . <span style="color: #80d200;">(</span>concat <span style="color: #72a4ff;">"Formal Signature\n"</span> <span style="color: #72a4ff;">"Emacs 25, org-mode 9, mu4e 1.0\n"</span><span style="color: #80d200;">)</span><span style="color: #00bdfa;">)</span>
               <span style="color: #00bdfa;">(</span>mu4e-compose-format-flowed . t<span style="color: #00bdfa;">)</span>
               <span style="color: #00bdfa;">(</span>smtpmail-queue-dir . <span style="color: #72a4ff;">"~/.Maildir/gmail-1/queue/cur"</span><span style="color: #00bdfa;">)</span>

               <span style="color: #00bdfa;">(</span><span style="color: #b6a0ff;">setq</span> message-sendmail-envelope-from 'header<span style="color: #00bdfa;">)</span>
               <span style="color: #00bdfa;">(</span>Mu4e-maildir-shortcuts . <span style="color: #80d200;">(</span> <span style="color: #f78fe7;">(</span><span style="color: #72a4ff;">"/gmail-1/INBOX"</span>            . ?i<span style="color: #f78fe7;">)</span>
                                           <span style="color: #f78fe7;">(</span><span style="color: #72a4ff;">"/gmail-1/[gmail1].Sent Mail"</span> . ?s<span style="color: #f78fe7;">)</span>
                                           <span style="color: #f78fe7;">(</span><span style="color: #72a4ff;">"/gmail-1/[gmail1].Bin"</span>       . ?t<span style="color: #f78fe7;">)</span>
                                            <span style="color: #f78fe7;">(</span><span style="color: #72a4ff;">"/gmail-1/[gmail1].All Mail"</span>  . ?a<span style="color: #f78fe7;">)</span>
                                           <span style="color: #f78fe7;">(</span><span style="color: #72a4ff;">"/gmail-1/[gmail1].Starred"</span>   . ?r<span style="color: #f78fe7;">)</span>
                                           <span style="color: #f78fe7;">(</span><span style="color: #72a4ff;">"/gmail-1/[gmail1].drafts"</span>    . ?d<span style="color: #f78fe7;">)</span>
                                           <span style="color: #80d200;">)</span><span style="color: #00bdfa;">)</span><span style="color: #f0ce43;">)</span><span style="color: #6ae4b9;">)</span>

<span style="color: #a8a8a8;">;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;; </span><span style="color: #a8a8a8;">Private Mail ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;</span>

      <span style="color: #6ae4b9;">(</span>make-mu4e-context
       <span style="color: #f78fe7;">:name</span> <span style="color: #72a4ff;">"personal"</span> <span style="color: #a8a8a8;">;;</span><span style="color: #a8a8a8;">for personal-mail</span>
        <span style="color: #f78fe7;">:enter-func</span> <span style="color: #f0ce43;">(</span><span style="color: #b6a0ff;">lambda</span> <span style="color: #00bdfa;">()</span> <span style="color: #00bdfa;">(</span>mu4e-message <span style="color: #72a4ff;">"Entering context personal"</span><span style="color: #00bdfa;">)</span><span style="color: #f0ce43;">)</span>
        <span style="color: #f78fe7;">:leave-func</span> <span style="color: #f0ce43;">(</span><span style="color: #b6a0ff;">lambda</span> <span style="color: #00bdfa;">()</span> <span style="color: #00bdfa;">(</span>mu4e-message <span style="color: #72a4ff;">"Leaving context personal"</span><span style="color: #00bdfa;">)</span><span style="color: #f0ce43;">)</span>

        <span style="color: #f78fe7;">:match-func</span> <span style="color: #f0ce43;">(</span><span style="color: #b6a0ff;">lambda</span> <span style="color: #00bdfa;">(</span>msg<span style="color: #00bdfa;">)</span>
           <span style="color: #00bdfa;">(</span><span style="color: #b6a0ff;">when</span> msg
         <span style="color: #80d200;">(</span>mu4e-message-contact-field-matches
          msg '<span style="color: #f78fe7;">(</span><span style="color: #f78fe7;">:from</span> <span style="color: #f78fe7;">:to</span> <span style="color: #f78fe7;">:cc</span> <span style="color: #f78fe7;">:bcc</span><span style="color: #f78fe7;">)</span> <span style="color: #72a4ff;">"personal@yoururl.urdomain"</span><span style="color: #80d200;">)</span><span style="color: #00bdfa;">)</span><span style="color: #f0ce43;">)</span>
        <span style="color: #f78fe7;">:vars</span> '<span style="color: #f0ce43;">(</span><span style="color: #00bdfa;">(</span>user-mail-address . <span style="color: #72a4ff;">"personal@yoururl.urdomain"</span><span style="color: #00bdfa;">)</span>
                <span style="color: #00bdfa;">(</span>user-full-name . <span style="color: #72a4ff;">"Ryan"</span><span style="color: #00bdfa;">)</span>      <span style="color: #00bdfa;">(</span>mu4e-sent-folder . <span style="color: #72a4ff;">"/personal-mail/[personal].Sent Mail"</span><span style="color: #00bdfa;">)</span>
            <span style="color: #00bdfa;">(</span>mu4e-drafts-folder . <span style="color: #72a4ff;">"/personal-mail/[personal].Drafts"</span><span style="color: #00bdfa;">)</span>
            <span style="color: #00bdfa;">(</span>mu4e-trash-folder . <span style="color: #72a4ff;">"/personal-mail/[personal].Trash"</span><span style="color: #00bdfa;">)</span>
            <span style="color: #00bdfa;">(</span>mu4e-compose-format-flowed . t<span style="color: #00bdfa;">)</span>
            <span style="color: #00bdfa;">(</span>smtpmail-queue-dir . <span style="color: #72a4ff;">"~/.Maildir/personal-mail/queue/cur"</span><span style="color: #00bdfa;">)</span>
            <span style="color: #00bdfa;">(</span>mu4e-maildir-shortcuts . <span style="color: #80d200;">(</span> <span style="color: #f78fe7;">(</span><span style="color: #72a4ff;">"/personal-mail/INBOX"</span>            . ?i<span style="color: #f78fe7;">)</span>
                     <span style="color: #f78fe7;">(</span><span style="color: #72a4ff;">"/personal-mail/[personal].Sent Mail"</span> . ?s<span style="color: #f78fe7;">)</span>
                     <span style="color: #f78fe7;">(</span><span style="color: #72a4ff;">"/personal-mail/[personal].Trash"</span>     . ?t<span style="color: #f78fe7;">)</span>
                     <span style="color: #f78fe7;">(</span><span style="color: #72a4ff;">"/personal-mail/[personal].Junk"</span>      . ?j<span style="color: #f78fe7;">)</span>
                     <span style="color: #f78fe7;">(</span><span style="color: #72a4ff;">"/personal-mail/[personal].Drafts"</span>    . ?d<span style="color: #f78fe7;">)</span>
                     <span style="color: #80d200;">)</span><span style="color: #00bdfa;">)</span><span style="color: #f0ce43;">)</span><span style="color: #6ae4b9;">)</span>
<span style="color: #a8a8a8;">;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;; </span><span style="color: #a8a8a8;">New Gmail ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;</span>
      <span style="color: #6ae4b9;">(</span>make-mu4e-context
       <span style="color: #f78fe7;">:name</span> <span style="color: #72a4ff;">"gmail"</span> <span style="color: #a8a8a8;">;;</span><span style="color: #a8a8a8;">for gmail-2</span>
       <span style="color: #f78fe7;">:enter-func</span> <span style="color: #f0ce43;">(</span><span style="color: #b6a0ff;">lambda</span> <span style="color: #00bdfa;">()</span> <span style="color: #00bdfa;">(</span>mu4e-message <span style="color: #72a4ff;">"Entering context gmail"</span><span style="color: #00bdfa;">)</span><span style="color: #f0ce43;">)</span>
       <span style="color: #f78fe7;">:leave-func</span> <span style="color: #f0ce43;">(</span><span style="color: #b6a0ff;">lambda</span> <span style="color: #00bdfa;">()</span> <span style="color: #00bdfa;">(</span>mu4e-message <span style="color: #72a4ff;">"Leaving context gmail"</span><span style="color: #00bdfa;">)</span><span style="color: #f0ce43;">)</span>
       <span style="color: #f78fe7;">:match-func</span> <span style="color: #f0ce43;">(</span><span style="color: #b6a0ff;">lambda</span> <span style="color: #00bdfa;">(</span>msg<span style="color: #00bdfa;">)</span>
                     <span style="color: #00bdfa;">(</span><span style="color: #b6a0ff;">when</span> msg
                   <span style="color: #80d200;">(</span>mu4e-message-contact-field-matches
                    msg '<span style="color: #f78fe7;">(</span><span style="color: #f78fe7;">:from</span> <span style="color: #f78fe7;">:to</span> <span style="color: #f78fe7;">:cc</span> <span style="color: #f78fe7;">:bcc</span><span style="color: #f78fe7;">)</span> <span style="color: #72a4ff;">"gmail2@gmail.com"</span><span style="color: #80d200;">)</span><span style="color: #00bdfa;">)</span><span style="color: #f0ce43;">)</span>
       <span style="color: #f78fe7;">:vars</span> '<span style="color: #f0ce43;">(</span><span style="color: #00bdfa;">(</span>user-mail-address . <span style="color: #72a4ff;">"gmail2@gmail.com"</span><span style="color: #00bdfa;">)</span>
               <span style="color: #00bdfa;">(</span>user-full-name . <span style="color: #72a4ff;">"Ryan"</span><span style="color: #00bdfa;">)</span>
               <span style="color: #00bdfa;">(</span>mu4e-sent-folder . <span style="color: #72a4ff;">"/gmail-2/[gmail2].Sent Mail"</span><span style="color: #00bdfa;">)</span>
               <span style="color: #00bdfa;">(</span>mu4e-drafts-folder . <span style="color: #72a4ff;">"/gmail-2/[gmail2].drafts"</span><span style="color: #00bdfa;">)</span>
               <span style="color: #00bdfa;">(</span>mu4e-trash-folder . <span style="color: #72a4ff;">"/gmail-2/[gmail2].Bin"</span><span style="color: #00bdfa;">)</span>
               <span style="color: #00bdfa;">(</span>mu4e-compose-signature . <span style="color: #80d200;">(</span>concat <span style="color: #72a4ff;">"Formal Signature\n"</span> <span style="color: #72a4ff;">"Emacs 25, org-mode 9, mu4e 1.0\n"</span><span style="color: #80d200;">)</span><span style="color: #00bdfa;">)</span>
               <span style="color: #00bdfa;">(</span>mu4e-compose-format-flowed . t<span style="color: #00bdfa;">)</span>
               <span style="color: #00bdfa;">(</span>smtpmail-queue-dir . <span style="color: #72a4ff;">"~/.Maildir/gmail-2/queue/cur"</span><span style="color: #00bdfa;">)</span>
               <span style="color: #00bdfa;">(</span><span style="color: #b6a0ff;">setq</span> message-sendmail-envelope-from 'header<span style="color: #00bdfa;">)</span>
               <span style="color: #00bdfa;">(</span>mu4e-maildir-shortcuts . <span style="color: #80d200;">(</span> <span style="color: #f78fe7;">(</span><span style="color: #72a4ff;">"/gmail-2/INBOX"</span>            . ?i<span style="color: #f78fe7;">)</span>
                                       <span style="color: #f78fe7;">(</span><span style="color: #72a4ff;">"/gmail-2/[gmail2].Sent Mail"</span> . ?s<span style="color: #f78fe7;">)</span>
                                       <span style="color: #f78fe7;">(</span><span style="color: #72a4ff;">"/gmail-2/[gmail2].Bin"</span>       . ?t<span style="color: #f78fe7;">)</span>
                                       <span style="color: #f78fe7;">(</span><span style="color: #72a4ff;">"/gmail-2/[gmail2].All Mail"</span>  . ?a<span style="color: #f78fe7;">)</span>
                                       <span style="color: #f78fe7;">(</span><span style="color: #72a4ff;">"/gmail-2/[gmail2].Starred"</span>   . ?r<span style="color: #f78fe7;">)</span>
                                       <span style="color: #f78fe7;">(</span><span style="color: #72a4ff;">"/gmail-2/[gmail2].drafts"</span>    . ?d<span style="color: #f78fe7;">)</span>
                                                   <span style="color: #80d200;">)</span><span style="color: #00bdfa;">)</span><span style="color: #f0ce43;">)</span><span style="color: #6ae4b9;">)</span>

              <span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>

<span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">Choose account label to feed msmtp -a option based on From header</span>
<span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">in Message buffer; This function must be added to</span>
<span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">message-send-mail-hook for on-the-fly change of From address before</span>
<span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">sending message since message-send-mail-hook is processed right</span>
<span style="color: #a8a8a8;">;; </span><span style="color: #a8a8a8;">before sending message.</span>
<span style="color: #00cd68;">(</span><span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">choose-msmtp-account</span> <span style="color: #b6a0ff;">()</span>
<span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff;">if</span> <span style="color: #6ae4b9;">(</span>message-mail-p<span style="color: #6ae4b9;">)</span>
<span style="color: #6ae4b9;">(</span><span style="color: #b6a0ff;">save-excursion</span>
<span style="color: #f0ce43;">(</span><span style="color: #b6a0ff;">let*</span>
   <span style="color: #00bdfa;">(</span><span style="color: #80d200;">(</span>from <span style="color: #f78fe7;">(</span><span style="color: #b6a0ff;">save-restriction</span>
        <span style="color: #4ae8fc;">(</span>message-narrow-to-headers<span style="color: #4ae8fc;">)</span>
        <span style="color: #4ae8fc;">(</span>message-fetch-field <span style="color: #72a4ff;">"from"</span><span style="color: #4ae8fc;">)</span><span style="color: #f78fe7;">)</span><span style="color: #80d200;">)</span>
    <span style="color: #80d200;">(</span>account
 <span style="color: #f78fe7;">(</span><span style="color: #b6a0ff;">cond</span>
  <span style="color: #4ae8fc;">(</span><span style="color: #cfdf30;">(</span>string-match <span style="color: #72a4ff;">"gmail1@gmail.com"</span> from<span style="color: #cfdf30;">)</span> <span style="color: #72a4ff;">"gmail1"</span><span style="color: #4ae8fc;">)</span>
  <span style="color: #4ae8fc;">(</span><span style="color: #cfdf30;">(</span>string-match <span style="color: #72a4ff;">"personal@yoururl.urdomain"</span> from<span style="color: #cfdf30;">)</span> <span style="color: #72a4ff;">"personal"</span><span style="color: #4ae8fc;">)</span>
      <span style="color: #4ae8fc;">(</span><span style="color: #cfdf30;">(</span>string-match <span style="color: #72a4ff;">"gmail2@gmail.com"</span> from<span style="color: #cfdf30;">)</span> <span style="color: #72a4ff;">"gmail2"</span><span style="color: #4ae8fc;">)</span><span style="color: #f78fe7;">)</span><span style="color: #80d200;">)</span><span style="color: #00bdfa;">)</span>
     <span style="color: #00bdfa;">(</span><span style="color: #b6a0ff;">setq</span> message-sendmail-extra-arguments <span style="color: #80d200;">(</span>list '<span style="color: #72a4ff;">"-a"</span> account<span style="color: #80d200;">)</span><span style="color: #00bdfa;">)</span><span style="color: #f0ce43;">)</span><span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>


<span style="color: #00cd68;">(</span><span style="color: #b6a0ff;">setq</span> message-sendmail-envelope-from 'header<span style="color: #00cd68;">)</span>
<span style="color: #00cd68;">(</span><span style="color: #b6a0ff;">setq</span> message-send-mail-function 'message-send-mail-with-sendmail
      sendmail-program <span style="color: #72a4ff;">"/usr/bin/msmtp"</span>
      user-full-name <span style="color: #72a4ff;">"Ryan"</span><span style="color: #00cd68;">)</span>

<span style="color: #00cd68;">(</span><span style="color: #b6a0ff;">setq</span> message-sendmail-envelope-from 'header<span style="color: #00cd68;">)</span>
<span style="color: #00cd68;">(</span>add-hook 'message-send-mail-hook 'choose-msmtp-account<span style="color: #00cd68;">)</span>

<span style="color: #00cd68;">(</span><span style="color: #b6a0ff;">setq</span> mu4e-html2text-command 'mu4e-shr2text<span style="color: #00cd68;">)</span> 
</pre>
</div>

<p>
Obviously, you should replace gmail1 with your gmail, etc. etc. you know the drill by now. 
</p>

<p>
Parts of this file also contain commented-out lines of configuration, and there are many ways you can customize your setup.
All of the extra packages like mu4e-alert are completely optional, you can remove any of them at will.
</p>

<p>
The bulk of this configuration file comes from <a href="https://www.reddit.com/r/emacs/comments/bfsck6/mu4e_for_dummies/"><code>mu4e</code> for dummies</a>, while the very handy function choose-msmtp-account
comes from <a href="https://notanumber.io/2016-10-03/better-email-with-mu4e/">Better Email With <code>mu4e</code></a>.
</p>

<p>
And that's it! Enjoy your newfound productivity. You're now once step closer to being free from big tech.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Ryan</p>
<p class="date">Created: 2020-07-01 Wed 17:06</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
